alambe94/xsdk-embedded-kit/src/components/xusbh/port/hil/am243x/xusbh_drv.c
// Copyright 2022 alambe94

// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0

// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// @file xusbh_drv.c
// @brief AM243x USB Host Controller Driver port scaffold.

// INCLUDES ////////////////////////////////////////////////////////////////////////
// COMPILER INCLUDES
#include <string.h>

// SYSTEM INCLUDES
#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
#include <drivers/hw_include/cslr_soc.h>
#include <drivers/hw_include/csl_types.h>
#include <drivers/hw_include/hw_types.h>
#include <drivers/sciclient/include/tisci/am64x_am243x/tisci_devices.h>
#include <drivers/soc.h>
#include <kernel/dpl/CacheP.h>
#include <kernel/dpl/SystemP.h>
#include <drivers/../usb/cdn/core_driver/common/include/cdn_errno.h>
#include <drivers/../usb/cdn/core_driver/common/include/cusb_ch9_if.h>
#include <drivers/../usb/cdn/core_driver/host/include/cdn_xhci_obj_if.h>
#include <drivers/../usb/cdn/core_driver/host/include/cdn_xhci_structs_if.h>
#include <drivers/../usb/cdn/core_driver/host/src/cdn_xhci_internal.h>
#include <drivers/../usb/cdn/core_driver/host/src/cdn_xhci_priv.h>
#include <drivers/../usb/cdn/core_driver/host/src/trb.h>
#include <drivers/../usb/cdn/soc/am64x_am243x/cslr_usb3p0ss_v5_2.h>
#if defined(xUSBH_AM243X_HCD_ENABLE_SUPER_SPEED)
#include <drivers/hw_include/am64x_am243x/cslr_main_ctrl_mmr.h>
#include "am243x_phy.h"
#endif
#endif

// MODULE INCLUDES
#include "xusbh_core.h"
#include "xusbh_drv.h"

// MACROS /////////////////////////////////////////////////////////////////////////
#define xUSBH_AM243X_HCD_USBSSP_ROOT_PORT                1U
#define xUSBH_AM243X_HCD_MODESTRAP_HOST                  1U
#define xUSBH_AM243X_HCD_READY_TIMEOUT_CYCLES            1000000U
#define xUSBH_AM243X_HCD_USB3_REFCLK_HZ                  100000000U
#define xUSBH_AM243X_HCD_USB3_LANE_FUNC_USB              1U
#define xUSBH_AM243X_HCD_SERDES0_CLKSEL_MAIN_PLL2_HSDIV4 3U
#define xUSBH_AM243X_HCD_ENDPOINT_DESC_SIZE              7U
#define xUSBH_AM243X_HCD_ENDPOINT_ADDR_EP0               0U

#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
#define xUSBH_AM243X_HCD_WRITE_REG_FIELD32(reg_addr, reg_field, value)                                                                      \
    am243x_hcd_write_field32((uintptr_t)(reg_addr), (uint32_t)reg_field##_MASK, (uint32_t)reg_field##_SHIFT, (uint32_t)(value))
#define xUSBH_AM243X_HCD_READ_REG_FIELD32(reg_addr, reg_field)                                                                              \
    am243x_hcd_read_field32((uintptr_t)(reg_addr), (uint32_t)reg_field##_MASK, (uint32_t)reg_field##_SHIFT)
#endif

// TYPES //////////////////////////////////////////////////////////////////////////
#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
typedef struct am243x_xhci_memory_t
{
    uint8_t scratchpad_pool[USBSSP_SCRATCHPAD_BUFF_NUM * USBSSP_PAGE_SIZE] __attribute__((aligned(USBSSP_PAGE_SIZE)));
    USBSSP_RingElementT event_pool[USBSSP_MAX_NUM_INTERRUPTERS][USBSSP_EVENT_QUEUE_SIZE] __attribute__((aligned(1024)));
    USBSSP_RingElementT ep_ring_pool[USBSSP_PRODUCER_QUEUE_SIZE * (USBSSP_MAX_EP_CONTEXT_NUM + 2U)] __attribute__((aligned(1024)));
    USBSSP_DcbaaT dcbaa __attribute__((aligned(USBSSP_DCBAA_ALIGNMENT)));
    USBSSP_InputContexT input_context __attribute__((aligned(1024)));
    USBSSP_OutputContexT output_context __attribute__((aligned(1024)));
    uint64_t scratchpad[USBSSP_SCRATCHPAD_BUFF_NUM + 1U] __attribute__((aligned(64)));
    uint64_t event_ring_segment_entry[USBSSP_MAX_NUM_INTERRUPTERS * USBSSP_ERST_ENTRY_SIZE] __attribute__((aligned(USBSSP_ERST_ALIGNMENT)));
    USBSSP_ProducerQueueT stream_memory_pool[USBSSP_MAX_EP_NUM_STRM_EN][USBSSP_STREAM_ARRAY_SIZE];
    USBSSP_RingElementT stream_ring[USBSSP_MAX_EP_NUM_STRM_EN][USBSSP_STREAM_ARRAY_SIZE][USBSSP_PRODUCER_QUEUE_SIZE]
        __attribute__((aligned(1024)));
    uint8_t ep0_buffer[USBSSP_EP0_DATA_BUFF_SIZE] __attribute__((aligned(64)));
} am243x_xhci_memory_t;

typedef struct am243x_hcd_endpoint_state_t
{
    xUSBH_Transfer_t *transfer;
    uint8_t endpoint_address;
    bool is_enabled;
    bool is_configuring;
} am243x_hcd_endpoint_state_t;
#endif

// VARIABLES //////////////////////////////////////////////////////////////////////
xUSBH_AM243x_HCD_Context_t xUSBH_AM243x_HCD_Context = {0};

#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
static CSL_usb3p0ss_cmnRegs *p_usbregs_tiwrap = (CSL_usb3p0ss_cmnRegs *)CSL_USB0_MMR_MMRVBP_USBSS_CMN_BASE;
static CSL_usb3p0ss_ctrlRegs *p_usbregs_ctlr = (CSL_usb3p0ss_ctrlRegs *)CSL_USB0_VBP2APB_WRAP_CONTROLLER_VBP_CORE_ADDR_MAP_BASE;
static USBSSP_OBJ *p_usbssp_obj = NULL;
static USBSSP_DriverResourcesT usbssp_resources __attribute__((aligned(USBSSP_PAGE_SIZE), section(".bss.nocache")));
static USBSSP_XhciResourcesT usbssp_mem_resources __attribute__((aligned(USBSSP_CONTEXT_ALIGNMENT), section(".bss.nocache")));
static am243x_xhci_memory_t xhci_memory __attribute__((section(".bss.nocache")));
static am243x_hcd_endpoint_state_t endpoint_states[USBSSP_EP_CONT_MAX];
#endif

// FUNCTION PROTOTYPES /////////////////////////////////////////////////////////////
static bool am243x_hcd_ctx_is_valid(const xUSBH_AM243x_HCD_Context_t *ctx);
#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
static xRETURN_t am243x_hcd_notify_port_event(xUSBH_AM243x_HCD_Context_t *ctx, xUSBH_HCD_Port_Event_t event);
static xRETURN_t
am243x_hcd_notify_transfer_event(xUSBH_AM243x_HCD_Context_t *ctx, xUSBH_Transfer_t *transfer, xUSBH_HCD_Transfer_Event_t event);
#endif
static xRETURN_t am243x_hcd_init(void *hcd_ctx, void *host_ctx, xUSBH_HCD_Event_Callback_t callback);
static xRETURN_t am243x_hcd_deinit(void *hcd_ctx);
static xRETURN_t am243x_hcd_start(void *hcd_ctx);
static xRETURN_t am243x_hcd_stop(void *hcd_ctx);
static xRETURN_t am243x_hcd_enable_interrupts(void *hcd_ctx);
static xRETURN_t am243x_hcd_disable_interrupts(void *hcd_ctx);
static xRETURN_t am243x_hcd_port_power(void *hcd_ctx, uint8_t port, bool enable);
static xRETURN_t am243x_hcd_port_reset(void *hcd_ctx, uint8_t port);
static xRETURN_t am243x_hcd_get_port_status(void *hcd_ctx, uint8_t port, xUSBH_HCD_Port_Status_t *status);
static xRETURN_t am243x_hcd_submit_transfer(void *hcd_ctx, xUSBH_Transfer_t *transfer);
static xRETURN_t am243x_hcd_cancel_transfer(void *hcd_ctx, xUSBH_Transfer_t *transfer);
static uint32_t am243x_hcd_get_frame_number(void *hcd_ctx);
#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
static uint32_t am243x_hcd_read32(uintptr_t address);
static void am243x_hcd_write32(uintptr_t address, uint32_t value);
static uint32_t am243x_hcd_read_field32(uintptr_t address, uint32_t mask, uint32_t shift);
static void am243x_hcd_write_field32(uintptr_t address, uint32_t mask, uint32_t shift, uint32_t value);
static xRETURN_t am243x_hcd_status_from_cdn(uint32_t status);
static USB_Speed_t am243x_hcd_speed_from_ch9(CH9_UsbSpeed speed);
static void am243x_hcd_configure_xhci_memory(void);
static bool am243x_hcd_is_super_speed_enabled(void);
static uint8_t am243x_hcd_endpoint_index_from_address(uint8_t endpoint_address);
static xRETURN_t am243x_hcd_transfer_endpoint_index(xUSBH_AM243x_HCD_Context_t *ctx, xUSBH_Transfer_t *transfer, uint8_t *ep_index);
static xRETURN_t am243x_hcd_find_device(const xUSBH_Context_t *host_ctx,
                                       uint8_t device_address,
                                       const xUSBH_Device_Context_t **device_ctx,
                                       uint8_t *device_index);
static xRETURN_t am243x_hcd_find_endpoint(const xUSBH_Context_t *host_ctx,
                                         uint8_t device_address,
                                         uint8_t endpoint_address,
                                         const xUSBH_Endpoint_Context_t **endpoint_ctx);
static void am243x_hcd_ch9_setup_from_transfer(const xUSBH_Transfer_t *transfer, CH9_UsbSetup *setup);
static void am243x_hcd_endpoint_descriptor_build(const xUSBH_Endpoint_Context_t *endpoint_ctx,
                                                uint8_t descriptor[xUSBH_AM243X_HCD_ENDPOINT_DESC_SIZE]);
static xRETURN_t am243x_hcd_cache_before_submit(const xUSBH_Transfer_t *transfer);
static void am243x_hcd_cache_after_complete(const xUSBH_Transfer_t *transfer);
static xUSBH_HCD_Transfer_Event_t am243x_hcd_transfer_event_from_cdn(uint32_t status, const USBSSP_RingElementT *event_ptr);
static void am243x_hcd_transfer_actual_length_set(xUSBH_Transfer_t *transfer, const USBSSP_RingElementT *event_ptr);
static void am243x_hcd_transfer_complete_common(USBSSP_DriverResourcesT *resources,
                                               uint32_t status,
                                               const USBSSP_RingElementT *event_ptr,
                                               uint8_t ep_index);
static void am243x_hcd_control_complete(USBSSP_DriverResourcesT *resources, uint32_t status, const USBSSP_RingElementT *event_ptr);
static void am243x_hcd_data_complete(USBSSP_DriverResourcesT *resources, uint32_t status, const USBSSP_RingElementT *event_ptr);
static xRETURN_t am243x_hcd_config_descriptor_seed(xUSBH_AM243x_HCD_Context_t *ctx, const xUSBH_Transfer_t *transfer);
static xRETURN_t am243x_hcd_enable_configured_endpoints(xUSBH_AM243x_HCD_Context_t *ctx, const xUSBH_Transfer_t *transfer);
static void am243x_hcd_issue_configure_endpoint_command(void);
static void am243x_hcd_configure_complete_poll(xUSBH_AM243x_HCD_Context_t *ctx);
#if defined(xUSBH_AM243X_HCD_ENABLE_SUPER_SPEED)
static xRETURN_t am243x_hcd_enable_usb3_phy(void);
#endif
static xRETURN_t am243x_hcd_wait_for_host_ready(void);
static xRETURN_t am243x_hcd_enable_usb0_host(void);
static xRETURN_t am243x_hcd_init_usbssp(xUSBH_AM243x_HCD_Context_t *ctx);
static xRETURN_t am243x_hcd_poll_port_connection(xUSBH_AM243x_HCD_Context_t *ctx, bool notify);
#endif

// MODULE FUNCTIONS IMPLEMENTATION ////////////////////////////////////////////////
static bool am243x_hcd_ctx_is_valid(const xUSBH_AM243x_HCD_Context_t *ctx)
{
    return (ctx != NULL) && (ctx->port == xUSBH_AM243X_HCD_USB0_PORT);
}

