alambe94/xsdk-embedded-kit/src/components/xusbh/port/hil/am243x/xusbh_drv.c
#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
static uint32_t am243x_hcd_read32(uintptr_t address)
{
    return *(volatile const uint32_t *)address;
}

static void am243x_hcd_write32(uintptr_t address, uint32_t value)
{
    *(volatile uint32_t *)address = value;
}

static uint32_t am243x_hcd_read_field32(uintptr_t address, uint32_t mask, uint32_t shift)
{
    return (am243x_hcd_read32(address) & mask) >> shift;
}

static void am243x_hcd_write_field32(uintptr_t address, uint32_t mask, uint32_t shift, uint32_t value)
{
    uint32_t reg_value = am243x_hcd_read32(address);

    reg_value &= ~mask;
    reg_value |= (value << shift) & mask;
    am243x_hcd_write32(address, reg_value);
}

static xRETURN_t am243x_hcd_notify_port_event(xUSBH_AM243x_HCD_Context_t *ctx, xUSBH_HCD_Port_Event_t event)
{
    xUSBH_HCD_Event_t hcd_event = {0};

    if ((ctx == NULL) || (ctx->event_callback == NULL) || (ctx->host_ctx == NULL))
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

    hcd_event.type = xUSBH_HCD_EVENT_TYPE_PORT;
    hcd_event.port = ctx->port;
    hcd_event.port_event = event;
    ctx->event_callback(ctx->host_ctx, &hcd_event);

    return xRETURN_OK;
}

static xRETURN_t
am243x_hcd_notify_transfer_event(xUSBH_AM243x_HCD_Context_t *ctx, xUSBH_Transfer_t *transfer, xUSBH_HCD_Transfer_Event_t event)
{
    xUSBH_HCD_Event_t hcd_event = {0};

    if ((ctx == NULL) || (ctx->event_callback == NULL) || (ctx->host_ctx == NULL) || (transfer == NULL))
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

    hcd_event.type = xUSBH_HCD_EVENT_TYPE_TRANSFER;
    hcd_event.port = ctx->port;
    hcd_event.transfer_event = event;
    hcd_event.transfer = transfer;
    ctx->event_callback(ctx->host_ctx, &hcd_event);

    return xRETURN_OK;
}

static xRETURN_t am243x_hcd_status_from_cdn(uint32_t status)
{
    xRETURN_t ret = xRETURN_xERR_xUSBH_INVALID_STATE;

    if (status == CDN_EOK)
    {
        ret = xRETURN_OK;
    }
    else if (status == CDN_ETIMEDOUT)
    {
        ret = xRETURN_xERR_xUSBH_TIMEOUT;
    }

    return ret;
}

static USB_Speed_t am243x_hcd_speed_from_ch9(CH9_UsbSpeed speed)
{
    USB_Speed_t mapped_speed = USB_SPEED_HIGH;

    switch (speed)
    {
    case CH9_USB_SPEED_LOW:
        mapped_speed = USB_SPEED_LOW;
        break;
    case CH9_USB_SPEED_FULL:
        mapped_speed = USB_SPEED_FULL;
        break;
    case CH9_USB_SPEED_HIGH:
        mapped_speed = USB_SPEED_HIGH;
        break;
    case CH9_USB_SPEED_SUPER:
    case CH9_USB_SPEED_SUPER_PLUS:
        mapped_speed = USB_SPEED_SUPER;
        break;
    default:
        mapped_speed = USB_SPEED_HIGH;
        break;
    }

    return mapped_speed;
}

static uint8_t am243x_hcd_endpoint_index_from_address(uint8_t endpoint_address)
{
    uint8_t endpoint_number = endpoint_address & USB_ENDP_ADDR_MASK;
    uint8_t is_in = ((endpoint_address & USB_ENDP_DIR_MASK) != 0U) ? 1U : 0U;

    if (endpoint_number == 0U)
    {
        return USBSSP_EP0_CONT_OFFSET;
    }

    return (uint8_t)((((endpoint_number - 1U) * 2U) + is_in) + USBSSP_EP_CONT_OFFSET);
}

static xRETURN_t am243x_hcd_find_device(const xUSBH_Context_t *host_ctx,
                                       uint8_t device_address,
                                       const xUSBH_Device_Context_t **device_ctx,
                                       uint8_t *device_index)
{
    if ((host_ctx == NULL) || (device_ctx == NULL) || (device_index == NULL))
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

    for (uint8_t i = 0U; i < xUSBH_MAX_DEVICES; i++)
    {
        if ((host_ctx->devices[i].is_allocated == true) && (host_ctx->devices[i].address == device_address))
        {
            *device_ctx = &host_ctx->devices[i];
            *device_index = i;
            return xRETURN_OK;
        }
    }

    return xRETURN_xERR_xUSBH_INVALID_OBJECT;
}

static xRETURN_t am243x_hcd_find_endpoint(const xUSBH_Context_t *host_ctx,
                                         uint8_t device_address,
                                         uint8_t endpoint_address,
                                         const xUSBH_Endpoint_Context_t **endpoint_ctx)
{
    const xUSBH_Device_Context_t *device_ctx = NULL;
    uint8_t device_index = 0U;
    xRETURN_t ret;

    if (endpoint_ctx == NULL)
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

    ret = am243x_hcd_find_device(host_ctx, device_address, &device_ctx, &device_index);
    if (ret != xRETURN_OK)
    {
        return ret;
    }

    (void)device_ctx;
    for (uint8_t i = 0U; i < xUSBH_MAX_ENDPOINTS; i++)
    {
        if ((host_ctx->endpoints[i].is_allocated == true) && (host_ctx->endpoints[i].device_index == device_index) &&
            (host_ctx->endpoints[i].endpoint_address == endpoint_address))
        {
            *endpoint_ctx = &host_ctx->endpoints[i];
            return xRETURN_OK;
        }
    }

    return xRETURN_xERR_xUSBH_INVALID_OBJECT;
}

static xRETURN_t am243x_hcd_transfer_endpoint_index(xUSBH_AM243x_HCD_Context_t *ctx, xUSBH_Transfer_t *transfer, uint8_t *ep_index)
{
    const xUSBH_Endpoint_Context_t *endpoint_ctx = NULL;
    uint8_t index;

    if ((ctx == NULL) || (transfer == NULL) || (ep_index == NULL))
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

    if ((transfer->endpoint_address == xUSBH_AM243X_HCD_ENDPOINT_ADDR_EP0) || (transfer->endpoint_type == USB_ENDP_TYPE_CTRL))
    {
        *ep_index = USBSSP_EP0_CONT_OFFSET;
        return xRETURN_OK;
    }

    if (am243x_hcd_find_endpoint((const xUSBH_Context_t *)ctx->host_ctx, transfer->device_address, transfer->endpoint_address,
                                &endpoint_ctx) != xRETURN_OK)
    {
        return xRETURN_xERR_xUSBH_INVALID_OBJECT;
    }

    index = am243x_hcd_endpoint_index_from_address(endpoint_ctx->endpoint_address);
    if ((index < USBSSP_EP_CONT_OFFSET) || (index >= USBSSP_EP_CONT_MAX))
    {
        return xRETURN_xERR_xUSBH_INVALID_ARGUMENT;
    }

    *ep_index = index;
    return xRETURN_OK;
}

