alambe94/xsdk-embedded-kit/src/components/xusbh/port/hil/am243x/xusbh_drv.c
static void am243x_hcd_ch9_setup_from_transfer(const xUSBH_Transfer_t *transfer, CH9_UsbSetup *setup)
{
    setup->bmRequestType = transfer->setup.bRequestType;
    setup->bRequest = transfer->setup.bRequest;
    setup->wValue = transfer->setup.wValue;
    setup->wIndex = transfer->setup.wIndex;
    setup->wLength = transfer->setup.wLength;
}

static void am243x_hcd_endpoint_descriptor_build(const xUSBH_Endpoint_Context_t *endpoint_ctx,
                                                uint8_t descriptor[xUSBH_AM243X_HCD_ENDPOINT_DESC_SIZE])
{
    uint16_t max_packet_size = endpoint_ctx->max_packet_size;

    descriptor[0] = USB_ENDPOINT_DESC_LEN;
    descriptor[1] = USB_DESC_TYPE_ENDPOINT;
    descriptor[2] = endpoint_ctx->endpoint_address;
    descriptor[3] = endpoint_ctx->endpoint_type & USB_ENDP_TYPE_MASK;
    descriptor[4] = (uint8_t)(max_packet_size & 0xFFU);
    descriptor[5] = (uint8_t)((max_packet_size >> 8U) & 0xFFU);
    descriptor[6] = endpoint_ctx->interval;
}

static xRETURN_t am243x_hcd_cache_before_submit(const xUSBH_Transfer_t *transfer)
{
    if ((transfer == NULL) || (transfer->data == NULL) || (transfer->length == 0U))
    {
        return xRETURN_OK;
    }

    if ((transfer->endpoint_type == USB_ENDP_TYPE_CTRL) && ((transfer->setup.bRequestType & USB_REQ_TYPE_IN) == 0U))
    {
        CacheP_wb(transfer->data, transfer->length, CacheP_TYPE_ALLD);
    }
    else if ((transfer->endpoint_type != USB_ENDP_TYPE_CTRL) && ((transfer->endpoint_address & USB_ENDP_DIR_MASK) == 0U))
    {
        CacheP_wb(transfer->data, transfer->length, CacheP_TYPE_ALLD);
    }

    return xRETURN_OK;
}

static void am243x_hcd_cache_after_complete(const xUSBH_Transfer_t *transfer)
{
    if ((transfer == NULL) || (transfer->data == NULL) || (transfer->length == 0U))
    {
        return;
    }

    if ((transfer->endpoint_type == USB_ENDP_TYPE_CTRL) && ((transfer->setup.bRequestType & USB_REQ_TYPE_IN) != 0U))
    {
        CacheP_inv(transfer->data, transfer->length, CacheP_TYPE_ALLD);
    }
    else if ((transfer->endpoint_type != USB_ENDP_TYPE_CTRL) && ((transfer->endpoint_address & USB_ENDP_DIR_MASK) != 0U))
    {
        CacheP_inv(transfer->data, transfer->length, CacheP_TYPE_ALLD);
    }
}

static xUSBH_HCD_Transfer_Event_t am243x_hcd_transfer_event_from_cdn(uint32_t status, const USBSSP_RingElementT *event_ptr)
{
    uint32_t completion_code = (event_ptr != NULL) ? getCompletionCode(event_ptr) : USBSSP_TRB_COMPLETE_INVALID;

    if ((status == CDN_ECANCELED) || (completion_code == USBSSP_TRB_COMPLETE_STOPPED) ||
        (completion_code == USBSSP_TRB_CMPL_CMD_RNG_STOPPED))
    {
        return xUSBH_HCD_TRANSFER_EVENT_CANCELLED;
    }
    if ((status == USBSSP_ESTALL) || (completion_code == USBSSP_TRB_COMPLETE_STALL_ERROR))
    {
        return xUSBH_HCD_TRANSFER_EVENT_STALLED;
    }
    if ((completion_code == USBSSP_TRB_CMPL_SHORT_PKT) || (completion_code == USBSSP_TRB_CMPL_STOP_SHORT_PKT))
    {
        return xUSBH_HCD_TRANSFER_EVENT_SHORT;
    }
    if ((status == CDN_EOK) && ((event_ptr == NULL) || (completion_code == USBSSP_TRB_COMPLETE_SUCCESS)))
    {
        return xUSBH_HCD_TRANSFER_EVENT_COMPLETE;
    }

    return xUSBH_HCD_TRANSFER_EVENT_ERROR;
}

static void am243x_hcd_transfer_actual_length_set(xUSBH_Transfer_t *transfer, const USBSSP_RingElementT *event_ptr)
{
    uint32_t residual = 0U;

    if (transfer == NULL)
    {
        return;
    }

    if (event_ptr != NULL)
    {
        residual = getTrEvtTrbTransLen(event_ptr);
    }

    transfer->actual_length = (residual < transfer->length) ? (transfer->length - residual) : transfer->length;
}

static void am243x_hcd_transfer_complete_common(USBSSP_DriverResourcesT *resources,
                                               uint32_t status,
                                               const USBSSP_RingElementT *event_ptr,
                                               uint8_t ep_index)
{
    xUSBH_AM243x_HCD_Context_t *ctx = &xUSBH_AM243x_HCD_Context;
    xUSBH_Transfer_t *transfer;
    xUSBH_HCD_Transfer_Event_t event;

    (void)resources;

    if (ep_index >= USBSSP_EP_CONT_MAX)
    {
        return;
    }

    transfer = endpoint_states[ep_index].transfer;
    if (transfer == NULL)
    {
        return;
    }

    event = am243x_hcd_transfer_event_from_cdn(status, event_ptr);
    am243x_hcd_transfer_actual_length_set(transfer, event_ptr);
    am243x_hcd_cache_after_complete(transfer);

    if ((endpoint_states[ep_index].is_configuring == true) && (event == xUSBH_HCD_TRANSFER_EVENT_COMPLETE))
    {
        if (am243x_hcd_enable_configured_endpoints(ctx, transfer) == xRETURN_OK)
        {
            endpoint_states[ep_index].is_configuring = false;
            endpoint_states[ep_index].transfer = transfer;
            return;
        }

        event = xUSBH_HCD_TRANSFER_EVENT_ERROR;
    }

    endpoint_states[ep_index].transfer = NULL;
    endpoint_states[ep_index].is_configuring = false;
    (void)am243x_hcd_notify_transfer_event(ctx, transfer, event);
}

static void am243x_hcd_control_complete(USBSSP_DriverResourcesT *resources, uint32_t status, const USBSSP_RingElementT *event_ptr)
{
    am243x_hcd_transfer_complete_common(resources, status, event_ptr, USBSSP_EP0_CONT_OFFSET);
}

static void am243x_hcd_data_complete(USBSSP_DriverResourcesT *resources, uint32_t status, const USBSSP_RingElementT *event_ptr)
{
    uint8_t ep_index = (event_ptr != NULL) ? getEndpoint(event_ptr) : USBSSP_EP_CONT_MAX;

    am243x_hcd_transfer_complete_common(resources, status, event_ptr, ep_index);
}

static xRETURN_t am243x_hcd_config_descriptor_seed(xUSBH_AM243x_HCD_Context_t *ctx, const xUSBH_Transfer_t *transfer)
{
    const xUSBH_Context_t *host_ctx = (const xUSBH_Context_t *)ctx->host_ctx;
    uint16_t total_length;

    if ((host_ctx == NULL) || (transfer == NULL) || (usbssp_resources.ep0Buff == NULL))
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }
    if (host_ctx->enumeration.config_total_length < USB_CONFIGURATION_DESC_LEN)
    {
        return xRETURN_xERR_xUSBH_INVALID_STATE;
    }

    total_length = host_ctx->enumeration.config_total_length;
    if ((uint32_t)total_length > USBSSP_EP0_DATA_BUFF_SIZE)
    {
        return xRETURN_xERR_xUSBH_INVALID_ARGUMENT;
    }

    (void)transfer;
    (void)memcpy(usbssp_resources.ep0Buff, host_ctx->control_buffer, total_length);
    CacheP_wb(usbssp_resources.ep0Buff, total_length, CacheP_TYPE_ALLD);

    return xRETURN_OK;
}

static xRETURN_t am243x_hcd_enable_configured_endpoints(xUSBH_AM243x_HCD_Context_t *ctx, const xUSBH_Transfer_t *transfer)
{
    const xUSBH_Context_t *host_ctx = (const xUSBH_Context_t *)ctx->host_ctx;
    const xUSBH_Device_Context_t *device_ctx = NULL;
    uint8_t device_index = 0U;

