alambe94/xsdk-embedded-kit/src/components/xusbh/port/hil/am243x/xusbh_drv.c
    if ((host_ctx == NULL) || (transfer == NULL) || (p_usbssp_obj == NULL))
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

    if (am243x_hcd_find_device(host_ctx, transfer->device_address, &device_ctx, &device_index) != xRETURN_OK)
    {
        return xRETURN_xERR_xUSBH_INVALID_OBJECT;
    }

    (void)device_ctx;
    usbssp_resources.inputContext->inputControlContext[0] = 0U;
    usbssp_resources.inputContext->inputControlContext[1] = cpuToLe32(1U);
    for (uint8_t i = 0U; i < xUSBH_MAX_ENDPOINTS; i++)
    {
        if ((host_ctx->endpoints[i].is_allocated == true) && (host_ctx->endpoints[i].device_index == device_index))
        {
            uint8_t descriptor[xUSBH_AM243X_HCD_ENDPOINT_DESC_SIZE] = {0};
            uint8_t ep_index = am243x_hcd_endpoint_index_from_address(host_ctx->endpoints[i].endpoint_address);
            uint32_t cdn_status;

            if ((ep_index < USBSSP_EP_CONT_OFFSET) || (ep_index >= USBSSP_EP_CONT_MAX))
            {
                return xRETURN_xERR_xUSBH_INVALID_ARGUMENT;
            }

            am243x_hcd_endpoint_descriptor_build(&host_ctx->endpoints[i], descriptor);
            cdn_status = p_usbssp_obj->enableEndpoint(&usbssp_resources, descriptor);
            if (cdn_status != CDN_EOK)
            {
                return am243x_hcd_status_from_cdn(cdn_status);
            }

            endpoint_states[ep_index].endpoint_address = host_ctx->endpoints[i].endpoint_address;
            endpoint_states[ep_index].is_enabled = true;
        }
    }

    (void)memcpy(&usbssp_resources.inputContextCopy, usbssp_resources.inputContext, sizeof(USBSSP_InputContexT));
    am243x_hcd_issue_configure_endpoint_command();
    return xRETURN_OK;
}

static void am243x_hcd_issue_configure_endpoint_command(void)
{
    uint64_t input_context_address = cpuToLe64((uint64_t)(uintptr_t)usbssp_resources.inputContext);

    usbssp_resources.commandQ.enqueuePtr->dword0 = (uint32_t)(input_context_address & 0xFFFFFFFFULL);
    usbssp_resources.commandQ.enqueuePtr->dword1 = (uint32_t)((input_context_address >> 32U) & 0xFFFFFFFFULL);
    usbssp_resources.commandQ.enqueuePtr->dword3 =
        cpuToLe32((((uint32_t)usbssp_resources.actualdeviceSlot << USBSSP_SLOT_ID_POS) | (USBSSP_TRB_CONF_EP_CMD << USBSSP_TRB_TYPE_POS) |
                   (uint32_t)usbssp_resources.commandQ.toogleBit));
    updateQueuePtr(&usbssp_resources.commandQ, 0U);
    usbssp_resources.commandQ.isRunningFlag = 1U;
    hostCmdDoorbell(&usbssp_resources);
}

static void am243x_hcd_configure_complete_poll(xUSBH_AM243x_HCD_Context_t *ctx)
{
    xUSBH_Transfer_t *transfer = endpoint_states[USBSSP_EP0_CONT_OFFSET].transfer;

    if ((transfer == NULL) || (endpoint_states[USBSSP_EP0_CONT_OFFSET].is_configuring == false) ||
        (usbssp_resources.commandQ.isRunningFlag != 0U))
    {
        return;
    }

    endpoint_states[USBSSP_EP0_CONT_OFFSET].transfer = NULL;
    endpoint_states[USBSSP_EP0_CONT_OFFSET].is_configuring = false;

    if (usbssp_resources.commandQ.completionCode == USBSSP_TRB_COMPLETE_SUCCESS)
    {
        (void)am243x_hcd_notify_transfer_event(ctx, transfer, xUSBH_HCD_TRANSFER_EVENT_COMPLETE);
    }
    else
    {
        (void)am243x_hcd_notify_transfer_event(ctx, transfer, xUSBH_HCD_TRANSFER_EVENT_ERROR);
    }
}

static void am243x_hcd_configure_xhci_memory(void)
{
    (void)memset(&xhci_memory, 0, sizeof(xhci_memory));
    (void)memset(&usbssp_mem_resources, 0, sizeof(usbssp_mem_resources));

    usbssp_mem_resources.dcbaa = &xhci_memory.dcbaa;
    usbssp_mem_resources.epRingPool = xhci_memory.ep_ring_pool;
    for (uint32_t i = 0U; i < USBSSP_MAX_NUM_INTERRUPTERS; i++)
    {
        usbssp_mem_resources.eventPool[i] = xhci_memory.event_pool[i];
    }
    usbssp_mem_resources.eventRingSegmentEntry = xhci_memory.event_ring_segment_entry;
    usbssp_mem_resources.inputContext = &xhci_memory.input_context;
    usbssp_mem_resources.outputContext = &xhci_memory.output_context;
    usbssp_mem_resources.scratchpad = xhci_memory.scratchpad;
    usbssp_mem_resources.scratchpadPool = xhci_memory.scratchpad_pool;
    usbssp_mem_resources.streamMemoryPool = &xhci_memory.stream_memory_pool;
    usbssp_mem_resources.streamRing = &xhci_memory.stream_ring;
    usbssp_mem_resources.ep0Buffer = xhci_memory.ep0_buffer;
}

static bool am243x_hcd_is_super_speed_enabled(void)
{
#if defined(xUSBH_AM243X_HCD_ENABLE_SUPER_SPEED)
    return true;
#else
    return false;
#endif
}

#if defined(xUSBH_AM243X_HCD_ENABLE_SUPER_SPEED)
static xRETURN_t am243x_hcd_enable_usb3_phy(void)
{
    int32_t soc_status = SOC_moduleClockEnable(TISCI_DEV_SERDES_10G0, 1U);

    if (soc_status != SystemP_SUCCESS)
    {
        return xRETURN_xERR_xUSBH_INVALID_STATE;
    }

    xUSBH_AM243X_HCD_WRITE_REG_FIELD32((CSL_CTRL_MMR0_CFG0_BASE + CSL_MAIN_CTRL_MMR_CFG0_SERDES0_LN0_CTRL),
                                      CSL_MAIN_CTRL_MMR_CFG0_SERDES0_LN0_CTRL_LANE_FUNC_SEL, xUSBH_AM243X_HCD_USB3_LANE_FUNC_USB);
    xUSBH_AM243X_HCD_WRITE_REG_FIELD32((CSL_CTRL_MMR0_CFG0_BASE + CSL_MAIN_CTRL_MMR_CFG0_SERDES0_CLKSEL),
                                      CSL_MAIN_CTRL_MMR_CFG0_SERDES0_CLKSEL_CORE_REFCLK_SEL,
                                      xUSBH_AM243X_HCD_SERDES0_CLKSEL_MAIN_PLL2_HSDIV4);

    if (am243x_wiz_init(CSL_SERDES_10G0_BASE, PHY_TYPE_USB3, 0U, xUSBH_AM243X_HCD_USB3_REFCLK_HZ) != 0)
    {
        return xRETURN_xERR_xUSBH_INVALID_STATE;
    }

    return xRETURN_OK;
}
#endif

static xRETURN_t am243x_hcd_wait_for_host_ready(void)
{
    uint32_t timeout = xUSBH_AM243X_HCD_READY_TIMEOUT_CYCLES;

    while ((xUSBH_AM243X_HCD_READ_REG_FIELD32(&p_usbregs_ctlr->DRD.OTGSTS, CSL_USB3P0SS_CTRL_DRD_OTGSTS_OTG_NRDY) != 0U) && (timeout > 0U))
    {
        timeout--;
    }
    if (timeout == 0U)
    {
        return xRETURN_xERR_xUSBH_TIMEOUT;
    }

    timeout = xUSBH_AM243X_HCD_READY_TIMEOUT_CYCLES;
    while ((xUSBH_AM243X_HCD_READ_REG_FIELD32(&p_usbregs_ctlr->DRD.OTGSTS, CSL_USB3P0SS_CTRL_DRD_OTGSTS_XHC_READY) == 0U) && (timeout > 0U))
    {
        timeout--;
    }
    if (timeout == 0U)
    {
        return xRETURN_xERR_xUSBH_TIMEOUT;
    }

    return xRETURN_OK;
}

