alambe94/xsdk-embedded-kit/src/components/xusbh/port/hil/am243x/xusbh_drv.c
static xRETURN_t am243x_hcd_enable_usb0_host(void)
{
    int32_t soc_status = SOC_moduleClockEnable(TISCI_DEV_USB0, 1U);
    xRETURN_t ret = xRETURN_OK;

    if (soc_status != SystemP_SUCCESS)
    {
        return xRETURN_xERR_xUSBH_INVALID_ARGUMENT;
    }

    SOC_controlModuleUnlockMMR(SOC_DOMAIN_ID_MAIN, 0U);
    SOC_controlModuleUnlockMMR(SOC_DOMAIN_ID_MAIN, 1U);
    SOC_controlModuleUnlockMMR(SOC_DOMAIN_ID_MAIN, 2U);

#if defined(xUSBH_AM243X_HCD_ENABLE_SUPER_SPEED)
    ret = am243x_hcd_enable_usb3_phy();
    if (ret != xRETURN_OK)
    {
        SOC_controlModuleLockMMR(SOC_DOMAIN_ID_MAIN, 0U);
        SOC_controlModuleLockMMR(SOC_DOMAIN_ID_MAIN, 1U);
        SOC_controlModuleLockMMR(SOC_DOMAIN_ID_MAIN, 2U);
        return ret;
    }
#endif

    xUSBH_AM243X_HCD_WRITE_REG_FIELD32(&p_usbregs_tiwrap->USB3P0SS_W1, CSL_USB3P0SS_CMN_USB3P0SS_W1_PWRUP_RST_N, 0U);
    xUSBH_AM243X_HCD_WRITE_REG_FIELD32(&p_usbregs_tiwrap->USB3P0SS_W1, CSL_USB3P0SS_CMN_USB3P0SS_W1_MODESTRAP_SEL, 1U);
    xUSBH_AM243X_HCD_WRITE_REG_FIELD32(&p_usbregs_tiwrap->USB3P0SS_W1, CSL_USB3P0SS_CMN_USB3P0SS_W1_MODESTRAP,
                                      xUSBH_AM243X_HCD_MODESTRAP_HOST);
    xUSBH_AM243X_HCD_WRITE_REG_FIELD32(&p_usbregs_tiwrap->USB3P0SS_W1, CSL_USB3P0SS_CMN_USB3P0SS_W1_USB2_ONLY_MODE,
                                      (am243x_hcd_is_super_speed_enabled() == true) ? 0U : 1U);
    xUSBH_AM243X_HCD_WRITE_REG_FIELD32(&p_usbregs_tiwrap->STATIC_CONFIG, CSL_USB3P0SS_CMN_STATIC_CONFIG_VBUS_SEL, 1U);
    xUSBH_AM243X_HCD_WRITE_REG_FIELD32(&p_usbregs_tiwrap->STATIC_CONFIG, CSL_USB3P0SS_CMN_STATIC_CONFIG_PLL_REF_SEL, 0x06U);
    xUSBH_AM243X_HCD_WRITE_REG_FIELD32(&p_usbregs_tiwrap->USB3P0SS_W1, CSL_USB3P0SS_CMN_USB3P0SS_W1_PWRUP_RST_N, 1U);
    am243x_hcd_write32((uintptr_t)&p_usbregs_ctlr->DRD.SESSVALID_DBNC_CFG, 0x000A0002U);

    ret = am243x_hcd_wait_for_host_ready();

    SOC_controlModuleLockMMR(SOC_DOMAIN_ID_MAIN, 0U);
    SOC_controlModuleLockMMR(SOC_DOMAIN_ID_MAIN, 1U);
    SOC_controlModuleLockMMR(SOC_DOMAIN_ID_MAIN, 2U);

    return ret;
}

static xRETURN_t am243x_hcd_init_usbssp(xUSBH_AM243x_HCD_Context_t *ctx)
{
    uint32_t cdn_status;

    if (ctx == NULL)
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

    (void)memset(&usbssp_resources, 0, sizeof(usbssp_resources));
    (void)memset(endpoint_states, 0, sizeof(endpoint_states));
    am243x_hcd_configure_xhci_memory();
    usbssp_resources.xhciMemRes = &usbssp_mem_resources;
    usbssp_resources.actualPort = xUSBH_AM243X_HCD_USBSSP_ROOT_PORT;
    usbssp_resources.actualSpeed = CH9_USB_SPEED_UNKNOWN;
    usbssp_resources.deviceModeFlag = 0U;
    usbssp_resources.usbModeFlag = (am243x_hcd_is_super_speed_enabled() == true) ? 3U : 2U;
    usbssp_resources.instanceNo = xUSBH_AM243X_HCD_USB0_INSTANCE;

    p_usbssp_obj = USBSSP_GetInstance();
    if (p_usbssp_obj == NULL)
    {
        return xRETURN_xERR_xUSBH_INVALID_STATE;
    }

    cdn_status = p_usbssp_obj->init(&usbssp_resources, (uintptr_t)&p_usbregs_ctlr->XHCI);
    if (cdn_status != CDN_EOK)
    {
        return am243x_hcd_status_from_cdn(cdn_status);
    }

    ctx->driver_object = p_usbssp_obj;
    ctx->driver_private = &usbssp_resources;
    ctx->is_hardware_initialized = true;

    return xRETURN_OK;
}

static xRETURN_t am243x_hcd_poll_port_connection(xUSBH_AM243x_HCD_Context_t *ctx, bool notify)
{
    uint8_t connected = 0U;
    bool was_connected;
    xRETURN_t ret;
    uint32_t cdn_status;

    if ((ctx == NULL) || (p_usbssp_obj == NULL))
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

    was_connected = ctx->is_port_connected;
    cdn_status = p_usbssp_obj->getPortConnected(&usbssp_resources, &connected);
    ret = am243x_hcd_status_from_cdn(cdn_status);
    if (ret != xRETURN_OK)
    {
        return ret;
    }

    ctx->is_port_connected = (connected != 0U);
    ctx->speed = am243x_hcd_speed_from_ch9(usbssp_resources.actualSpeed);

    if ((notify == true) && (ctx->is_port_connected != was_connected))
    {
        if (ctx->is_port_connected == true)
        {
            ret = am243x_hcd_notify_port_event(ctx, xUSBH_HCD_PORT_EVENT_CONNECTED);
        }
        else
        {
            ret = am243x_hcd_notify_port_event(ctx, xUSBH_HCD_PORT_EVENT_DISCONNECTED);
        }
    }

    return ret;
}
#endif

static xRETURN_t am243x_hcd_init(void *hcd_ctx, void *host_ctx, xUSBH_HCD_Event_Callback_t callback)
{
    xUSBH_AM243x_HCD_Context_t *ctx = (xUSBH_AM243x_HCD_Context_t *)hcd_ctx;

    if ((ctx == NULL) || (host_ctx == NULL) || (callback == NULL))
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

    (void)memset(ctx, 0, sizeof(*ctx));
    ctx->host_ctx = host_ctx;
    ctx->event_callback = callback;
    ctx->speed = USB_SPEED_HIGH;
    ctx->port = xUSBH_AM243X_HCD_USB0_PORT;
    ctx->is_initialized = true;

    return xRETURN_OK;
}

static xRETURN_t am243x_hcd_deinit(void *hcd_ctx)
{
    xUSBH_AM243x_HCD_Context_t *ctx = (xUSBH_AM243x_HCD_Context_t *)hcd_ctx;

    if (ctx == NULL)
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

    (void)memset(ctx, 0, sizeof(*ctx));

    return xRETURN_OK;
}

static xRETURN_t am243x_hcd_start(void *hcd_ctx)
{
    xUSBH_AM243x_HCD_Context_t *ctx = (xUSBH_AM243x_HCD_Context_t *)hcd_ctx;

    if (am243x_hcd_ctx_is_valid(ctx) == false)
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }
    if (ctx->is_initialized == false)
    {
        return xRETURN_xERR_xUSBH_NOT_INITIALIZED;
    }

#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
    if (ctx->is_hardware_initialized == false)
    {
        xRETURN_t ret = am243x_hcd_enable_usb0_host();
        if (ret != xRETURN_OK)
        {
            return ret;
        }

        ret = am243x_hcd_init_usbssp(ctx);
        if (ret != xRETURN_OK)
        {
            return ret;
        }
    }

    ctx->is_started = true;
    ctx->is_port_powered = true;
    (void)am243x_hcd_poll_port_connection(ctx, true);

    return xRETURN_OK;
#else
    return xRETURN_xERR_xUSBH_UNSUPPORTED_OPERATION;
#endif
}

static xRETURN_t am243x_hcd_stop(void *hcd_ctx)
{
    xUSBH_AM243x_HCD_Context_t *ctx = (xUSBH_AM243x_HCD_Context_t *)hcd_ctx;

    if (am243x_hcd_ctx_is_valid(ctx) == false)
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

    ctx->is_started = false;
    ctx->are_interrupts_enabled = false;

    return xRETURN_OK;
}

static xRETURN_t am243x_hcd_enable_interrupts(void *hcd_ctx)
{
    xUSBH_AM243x_HCD_Context_t *ctx = (xUSBH_AM243x_HCD_Context_t *)hcd_ctx;

    if (am243x_hcd_ctx_is_valid(ctx) == false)
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }
    if (ctx->is_initialized == false)
    {
        return xRETURN_xERR_xUSBH_NOT_INITIALIZED;
    }

    ctx->are_interrupts_enabled = true;

    return xRETURN_OK;
}

static xRETURN_t am243x_hcd_disable_interrupts(void *hcd_ctx)
{
    xUSBH_AM243x_HCD_Context_t *ctx = (xUSBH_AM243x_HCD_Context_t *)hcd_ctx;

    if (am243x_hcd_ctx_is_valid(ctx) == false)
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

    ctx->are_interrupts_enabled = false;

    return xRETURN_OK;
}

static xRETURN_t am243x_hcd_port_power(void *hcd_ctx, uint8_t port, bool enable)
{
    xUSBH_AM243x_HCD_Context_t *ctx = (xUSBH_AM243x_HCD_Context_t *)hcd_ctx;

    if (am243x_hcd_ctx_is_valid(ctx) == false)
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }
    if (port != xUSBH_AM243X_HCD_USB0_PORT)
    {
        return xRETURN_xERR_xUSBH_INVALID_ARGUMENT;
    }

