alambe94/xsdk-embedded-kit/src/components/xusbh/port/hil/am243x/xusbh_drv.c
#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
    ctx->is_port_powered = enable;

    return xRETURN_OK;
#else
    ctx->is_port_powered = enable;

    return xRETURN_xERR_xUSBH_UNSUPPORTED_OPERATION;
#endif
}

static xRETURN_t am243x_hcd_port_reset(void *hcd_ctx, uint8_t port)
{
    xUSBH_AM243x_HCD_Context_t *ctx = (xUSBH_AM243x_HCD_Context_t *)hcd_ctx;

    if (am243x_hcd_ctx_is_valid(ctx) == false)
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }
    if (port != xUSBH_AM243X_HCD_USB0_PORT)
    {
        return xRETURN_xERR_xUSBH_INVALID_ARGUMENT;
    }

#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
    if ((ctx->is_hardware_initialized == false) || (p_usbssp_obj == NULL))
    {
        return xRETURN_xERR_xUSBH_NOT_INITIALIZED;
    }

    xRETURN_t ret = am243x_hcd_status_from_cdn(p_usbssp_obj->resetRootHubPort(&usbssp_resources));
    if (ret == xRETURN_OK)
    {
        ret = am243x_hcd_notify_port_event(ctx, xUSBH_HCD_PORT_EVENT_RESET_COMPLETE);
    }

    return ret;
#else
    return xRETURN_xERR_xUSBH_UNSUPPORTED_OPERATION;
#endif
}

static xRETURN_t am243x_hcd_get_port_status(void *hcd_ctx, uint8_t port, xUSBH_HCD_Port_Status_t *status)
{
    xUSBH_AM243x_HCD_Context_t *ctx = (xUSBH_AM243x_HCD_Context_t *)hcd_ctx;

    if ((am243x_hcd_ctx_is_valid(ctx) == false) || (status == NULL))
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }
    if (port != xUSBH_AM243X_HCD_USB0_PORT)
    {
        return xRETURN_xERR_xUSBH_INVALID_ARGUMENT;
    }

    (void)memset(status, 0, sizeof(*status));
    status->speed = ctx->speed;

#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
    if ((ctx->is_hardware_initialized == false) || (p_usbssp_obj == NULL))
    {
        return xRETURN_xERR_xUSBH_NOT_INITIALIZED;
    }

    xRETURN_t ret = am243x_hcd_poll_port_connection(ctx, false);
    if (ret != xRETURN_OK)
    {
        return ret;
    }

    status->is_connected = ctx->is_port_connected;
    status->is_enabled = ctx->is_port_connected;
    status->is_suspended = false;
    status->is_overcurrent = false;
    status->speed = ctx->speed;

    return xRETURN_OK;
#else
    return xRETURN_xERR_xUSBH_UNSUPPORTED_OPERATION;
#endif
}

static xRETURN_t am243x_hcd_submit_transfer(void *hcd_ctx, xUSBH_Transfer_t *transfer)
{
    xUSBH_AM243x_HCD_Context_t *ctx = (xUSBH_AM243x_HCD_Context_t *)hcd_ctx;

    if ((am243x_hcd_ctx_is_valid(ctx) == false) || (transfer == NULL))
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
    uint8_t ep_index = 0U;
    xRETURN_t ret;

    if ((ctx->is_hardware_initialized == false) || (p_usbssp_obj == NULL))
    {
        return xRETURN_xERR_xUSBH_NOT_INITIALIZED;
    }

    ret = am243x_hcd_transfer_endpoint_index(ctx, transfer, &ep_index);
    if (ret != xRETURN_OK)
    {
        return ret;
    }
    if (endpoint_states[ep_index].transfer != NULL)
    {
        return xRETURN_xERR_xUSBH_INVALID_STATE;
    }

    ret = am243x_hcd_cache_before_submit(transfer);
    if (ret != xRETURN_OK)
    {
        return ret;
    }

    endpoint_states[ep_index].transfer = transfer;
    endpoint_states[ep_index].endpoint_address = transfer->endpoint_address;
    endpoint_states[ep_index].is_configuring = false;

    if ((transfer->endpoint_type == USB_ENDP_TYPE_CTRL) || (transfer->endpoint_address == xUSBH_AM243X_HCD_ENDPOINT_ADDR_EP0))
    {
        CH9_UsbSetup setup = {0};
        uint32_t cdn_status;

        am243x_hcd_ch9_setup_from_transfer(transfer, &setup);
        if ((setup.bRequest == USB_REQ_SET_ADDRESS) && ((setup.bmRequestType & USB_REQ_TYPE_MASK) == USB_REQ_TYPE_STANDARD))
        {
            cdn_status = p_usbssp_obj->noOpTest(&usbssp_resources, am243x_hcd_control_complete);
            if (cdn_status != CDN_EOK)
            {
                endpoint_states[ep_index].transfer = NULL;
                return am243x_hcd_status_from_cdn(cdn_status);
            }

            return xRETURN_OK;
        }

        if ((setup.bRequest == USB_REQ_SET_CONFIGURATION) && ((setup.bmRequestType & USB_REQ_TYPE_MASK) == USB_REQ_TYPE_STANDARD))
        {
            ret = am243x_hcd_config_descriptor_seed(ctx, transfer);
            if (ret != xRETURN_OK)
            {
                endpoint_states[ep_index].transfer = NULL;
                return ret;
            }
            endpoint_states[ep_index].is_configuring = true;
        }

        cdn_status = p_usbssp_obj->nBControlTransfer(&usbssp_resources, &setup, transfer->data, am243x_hcd_control_complete);
        if (cdn_status != CDN_EOK)
        {
            endpoint_states[ep_index].transfer = NULL;
            endpoint_states[ep_index].is_configuring = false;
            return am243x_hcd_status_from_cdn(cdn_status);
        }

        return xRETURN_OK;
    }

    if (endpoint_states[ep_index].is_enabled == false)
    {
        endpoint_states[ep_index].transfer = NULL;
        return xRETURN_xERR_xUSBH_INVALID_STATE;
    }

    uint32_t cdn_status =
        p_usbssp_obj->transferData(&usbssp_resources, ep_index, (uintptr_t)transfer->data, transfer->length, am243x_hcd_data_complete);
    if (cdn_status != CDN_EOK)
    {
        endpoint_states[ep_index].transfer = NULL;
        return am243x_hcd_status_from_cdn(cdn_status);
    }

    return xRETURN_OK;
#else
    return xRETURN_xERR_xUSBH_UNSUPPORTED_OPERATION;
#endif
}

static xRETURN_t am243x_hcd_cancel_transfer(void *hcd_ctx, xUSBH_Transfer_t *transfer)
{
    xUSBH_AM243x_HCD_Context_t *ctx = (xUSBH_AM243x_HCD_Context_t *)hcd_ctx;

    if ((am243x_hcd_ctx_is_valid(ctx) == false) || (transfer == NULL))
    {
        return xRETURN_xERR_xUSBH_NULL_POINTER;
    }

#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
    uint8_t ep_index = 0U;
    xRETURN_t ret;

    if ((ctx->is_hardware_initialized == false) || (p_usbssp_obj == NULL))
    {
        return xRETURN_xERR_xUSBH_NOT_INITIALIZED;
    }

    ret = am243x_hcd_transfer_endpoint_index(ctx, transfer, &ep_index);
    if (ret != xRETURN_OK)
    {
        return ret;
    }

    endpoint_states[ep_index].transfer = NULL;
    endpoint_states[ep_index].is_configuring = false;

