alambe94/xsdk-embedded-kit/src/components/xusbh/port/hil/am243x/xusbh_drv.c
    return am243x_hcd_status_from_cdn(p_usbssp_obj->stopEndpoint(&usbssp_resources, ep_index));
#else
    return xRETURN_xERR_xUSBH_UNSUPPORTED_OPERATION;
#endif
}

static uint32_t am243x_hcd_get_frame_number(void *hcd_ctx)
{
    const xUSBH_AM243x_HCD_Context_t *ctx = (const xUSBH_AM243x_HCD_Context_t *)hcd_ctx;

    if (am243x_hcd_ctx_is_valid(ctx) == false)
    {
        return 0U;
    }

#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
    if ((ctx->is_hardware_initialized == true) && (p_usbssp_obj != NULL))
    {
        uint32_t frame_number = 0U;
        if (p_usbssp_obj->getMicroFrameIndex(&usbssp_resources, &frame_number) == CDN_EOK)
        {
            ((xUSBH_AM243x_HCD_Context_t *)ctx)->frame_number = frame_number;
        }
    }
#endif

    return ctx->frame_number;
}

// PUBLIC FUNCTIONS IMPLEMENTATION ////////////////////////////////////////////////
void xUSBH_AM243x_HCD_IRQ_Handler(uint8_t port)
{
#if defined(xUSBH_AM243X_HCD_ENABLE_MCU_PLUS_SDK)
    xUSBH_AM243x_HCD_Context_t *ctx = &xUSBH_AM243x_HCD_Context;

    if ((port == xUSBH_AM243X_HCD_USB0_PORT) && (ctx->is_hardware_initialized == true) && (p_usbssp_obj != NULL))
    {
        (void)p_usbssp_obj->isr(&usbssp_resources);
        am243x_hcd_configure_complete_poll(ctx);
        (void)am243x_hcd_poll_port_connection(ctx, true);
    }
#else
    (void)port;
#endif
}

const xUSBH_HCD_Ops_t xUSBH_AM243x_HCD_Ops = {
    .init = am243x_hcd_init,
    .deinit = am243x_hcd_deinit,
    .start = am243x_hcd_start,
    .stop = am243x_hcd_stop,
    .enable_interrupts = am243x_hcd_enable_interrupts,
    .disable_interrupts = am243x_hcd_disable_interrupts,
    .port_power = am243x_hcd_port_power,
    .port_reset = am243x_hcd_port_reset,
    .get_port_status = am243x_hcd_get_port_status,
    .submit_transfer = am243x_hcd_submit_transfer,
    .cancel_transfer = am243x_hcd_cancel_transfer,
    .get_frame_number = am243x_hcd_get_frame_number,
};
// EOF /////////////////////////////////////////////////////////////////////////////

